Revit 2027 API
ZoneEquipmentData.CoolingCoilType Property
 The type of cooling coil. Note this property change would reset the chilled water loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AirCoolingCoilType CoolingCoilType { get; set; }
Public Property CoolingCoilType As AirCoolingCoilType
	Get
	Set
public:
property AirCoolingCoilType CoolingCoilType {
	AirCoolingCoilType get ();
	void set (AirCoolingCoilType value);
}
member CoolingCoilType : AirCoolingCoilType with get, set
Property Value
AirCoolingCoilType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace